TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/pin_map.h
#define GPIO_37_GPIO37                  0x00460A00U
#define GPIO_37_OUTPUTXBAR2             0x00460A01U
#define GPIO_37_I2CA_SCL                0x00460A03U
#define GPIO_37_SCIA_TX                 0x00460A05U
#define GPIO_37_CANA_TX                 0x00460A06U
#define GPIO_37_LINA_TX                 0x00460A07U
#define GPIO_37_EQEP1_B                 0x00460A09U
#define GPIO_37_PMBUSA_ALERT            0x00460A0AU
#define GPIO_37_HIC_NRDY                0x00460A0EU
#define GPIO_37_TDO                     0x00460A0FU

#define GPIO_39_GPIO39                  0x00460E00U
#define GPIO_39_MCAN_RX                 0x00460E06U
#define GPIO_39_FSIRXA_CLK              0x00460E07U
#define GPIO_39_EQEP2_INDEX             0x00460E09U
#define GPIO_39_CLB_OUTPUTXBAR2         0x00460E0BU
#define GPIO_39_SYNCOUT                 0x00460E0DU
#define GPIO_39_EQEP1_INDEX             0x00460E0EU
#define GPIO_39_HIC_D7                  0x00460E0FU

#define GPIO_40_GPIO40                  0x00461000U
#define GPIO_40_SPIB_SIMO               0x00461001U
#define GPIO_40_EPWM2_B                 0x00461005U
#define GPIO_40_PMBUSA_SDA              0x00461006U
#define GPIO_40_FSIRXA_D0               0x00461007U
#define GPIO_40_SCIB_TX                 0x00461009U
#define GPIO_40_EQEP1_A                 0x0046100AU
#define GPIO_40_LINB_TX                 0x0046100BU
#define GPIO_40_HIC_NBE1                0x0046100EU
#define GPIO_40_HIC_D5                  0x0046100FU

#define GPIO_41_GPIO41                  0x00461200U
#define GPIO_41_EPWM2_A                 0x00461205U
#define GPIO_41_PMBUSA_SCL              0x00461206U
#define GPIO_41_FSIRXA_D1               0x00461207U
#define GPIO_41_SCIB_RX                 0x00461209U
#define GPIO_41_EQEP1_B                 0x0046120AU
#define GPIO_41_LINB_RX                 0x0046120BU
#define GPIO_41_HIC_A4                  0x0046120DU
#define GPIO_41_SPIB_SOMI               0x0046120EU
#define GPIO_41_HIC_D12                 0x0046120FU

#define GPIO_42_GPIO42                  0x00461400U
#define GPIO_42_LINA_RX                 0x00461402U
#define GPIO_42_OUTPUTXBAR5             0x00461403U
#define GPIO_42_PMBUSA_CTL              0x00461405U
#define GPIO_42_I2CA_SDA                0x00461406U
#define GPIO_42_EQEP1_STROBE            0x0046140AU
#define GPIO_42_CLB_OUTPUTXBAR3         0x0046140BU
#define GPIO_42_HIC_D2                  0x0046140EU
#define GPIO_42_HIC_A6                  0x0046140FU

#define GPIO_43_GPIO43                  0x00461600U
#define GPIO_43_OUTPUTXBAR6             0x00461603U
#define GPIO_43_PMBUSA_ALERT            0x00461605U
#define GPIO_43_I2CA_SCL                0x00461606U
#define GPIO_43_EQEP1_INDEX             0x0046160AU
#define GPIO_43_CLB_OUTPUTXBAR4         0x0046160BU
#define GPIO_43_SD2_D3                  0x0046160DU
#define GPIO_43_HIC_D3                  0x0046160EU
#define GPIO_43_HIC_A7                  0x0046160FU

#define GPIO_44_GPIO44                  0x00461800U
#define GPIO_44_OUTPUTXBAR7             0x00461803U
#define GPIO_44_EQEP1_A                 0x00461805U
#define GPIO_44_PMBUSA_SDA              0x00461806U
#define GPIO_44_FSITXA_CLK              0x00461807U
#define GPIO_44_PMBUSA_CTL              0x00461809U
#define GPIO_44_CLB_OUTPUTXBAR3         0x0046180AU
#define GPIO_44_FSIRXA_D0               0x0046180BU
#define GPIO_44_HIC_D7                  0x0046180DU
#define GPIO_44_LINB_TX                 0x0046180EU
#define GPIO_44_HIC_D5                  0x0046180FU

#define GPIO_45_GPIO45                  0x00461A00U
#define GPIO_45_OUTPUTXBAR8             0x00461A03U
#define GPIO_45_FSITXA_D0               0x00461A07U
#define GPIO_45_PMBUSA_ALERT            0x00461A09U
#define GPIO_45_CLB_OUTPUTXBAR4         0x00461A0AU
#define GPIO_45_SD2_C3                  0x00461A0DU
#define GPIO_45_HIC_D6                  0x00461A0FU

#define GPIO_46_GPIO46                  0x00461C00U
#define GPIO_46_LINA_TX                 0x00461C03U
#define GPIO_46_MCAN_TX                 0x00461C05U
#define GPIO_46_FSITXA_D1               0x00461C07U
#define GPIO_46_PMBUSA_SDA              0x00461C09U
#define GPIO_46_SD2_C4                  0x00461C0DU
#define GPIO_46_HIC_NWE                 0x00461C0FU

#define GPIO_47_GPIO47                  0x00461E00U
#define GPIO_47_LINA_RX                 0x00461E03U
#define GPIO_47_MCAN_RX                 0x00461E05U
#define GPIO_47_CLB_OUTPUTXBAR2         0x00461E07U
#define GPIO_47_PMBUSA_SCL              0x00461E09U
#define GPIO_47_SD2_D4                  0x00461E0DU
#define GPIO_47_FSITXA_TDM_CLK          0x00461E0EU
#define GPIO_47_HIC_A6                  0x00461E0FU

#define GPIO_48_GPIO48                  0x00480000U
#define GPIO_48_OUTPUTXBAR3             0x00480001U
#define GPIO_48_CANA_TX                 0x00480003U
#define GPIO_48_SCIA_TX                 0x00480006U
#define GPIO_48_SD1_D1                  0x00480007U
#define GPIO_48_PMBUSA_SDA              0x00480009U
#define GPIO_48_HIC_A7                  0x0048000FU

#define GPIO_49_GPIO49                  0x00480200U
#define GPIO_49_OUTPUTXBAR4             0x00480201U
#define GPIO_49_CANA_RX                 0x00480203U
#define GPIO_49_SCIA_RX                 0x00480206U
#define GPIO_49_SD1_C1                  0x00480207U
#define GPIO_49_LINA_RX                 0x00480209U
#define GPIO_49_SD2_D1                  0x0048020DU
#define GPIO_49_FSITXA_D0               0x0048020EU
#define GPIO_49_HIC_D2                  0x0048020FU

#define GPIO_50_GPIO50                  0x00480400U
#define GPIO_50_EQEP1_A                 0x00480401U
#define GPIO_50_MCAN_TX                 0x00480405U
#define GPIO_50_SPIB_SIMO               0x00480406U
#define GPIO_50_SD1_D2                  0x00480407U
#define GPIO_50_I2CB_SDA                0x00480409U
#define GPIO_50_SD2_D2                  0x0048040DU
#define GPIO_50_FSITXA_D1               0x0048040EU
#define GPIO_50_HIC_D3                  0x0048040FU

#define GPIO_51_GPIO51                  0x00480600U
#define GPIO_51_EQEP1_B                 0x00480601U
#define GPIO_51_MCAN_RX                 0x00480605U
#define GPIO_51_SPIB_SOMI               0x00480606U
#define GPIO_51_SD1_C2                  0x00480607U
#define GPIO_51_I2CB_SCL                0x00480609U
#define GPIO_51_SD2_D3                  0x0048060DU
#define GPIO_51_FSITXA_CLK              0x0048060EU
#define GPIO_51_HIC_D6                  0x0048060FU

#define GPIO_52_GPIO52                  0x00480800U
#define GPIO_52_EQEP1_STROBE            0x00480801U
#define GPIO_52_CLB_OUTPUTXBAR5         0x00480805U
#define GPIO_52_SPIB_CLK                0x00480806U
#define GPIO_52_SD1_D3                  0x00480807U
#define GPIO_52_SYNCOUT                 0x00480809U
#define GPIO_52_SD2_D4                  0x0048080DU
#define GPIO_52_FSIRXA_D0               0x0048080EU
#define GPIO_52_HIC_NWE                 0x0048080FU

#define GPIO_53_GPIO53                  0x00480A00U
#define GPIO_53_EQEP1_INDEX             0x00480A01U
#define GPIO_53_CLB_OUTPUTXBAR6         0x00480A05U
#define GPIO_53_SPIB_STE                0x00480A06U
#define GPIO_53_SD1_C3                  0x00480A07U
#define GPIO_53_ADCSOCAO                0x00480A09U
#define GPIO_53_CANA_RX                 0x00480A0AU
#define GPIO_53_SD1_C1                  0x00480A0DU
#define GPIO_53_FSIRXA_D1               0x00480A0EU

#define GPIO_54_GPIO54                  0x00480C00U
#define GPIO_54_SPIA_SIMO               0x00480C01U
#define GPIO_54_EQEP2_A                 0x00480C05U
#define GPIO_54_OUTPUTXBAR2             0x00480C06U
#define GPIO_54_SD1_D4                  0x00480C07U
#define GPIO_54_ADCSOCBO                0x00480C09U
#define GPIO_54_LINB_TX                 0x00480C0AU
#define GPIO_54_SD1_C2                  0x00480C0DU
#define GPIO_54_FSIRXA_CLK              0x00480C0EU
#define GPIO_54_FSITXA_TDM_D1           0x00480C0FU

