TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/pin_map.h
#define GPIO_55_GPIO55                  0x00480E00U
#define GPIO_55_SPIA_SOMI               0x00480E01U
#define GPIO_55_EQEP2_B                 0x00480E05U
#define GPIO_55_OUTPUTXBAR3             0x00480E06U
#define GPIO_55_SD1_C4                  0x00480E07U
#define GPIO_55_ERRORSTS                0x00480E09U
#define GPIO_55_LINB_RX                 0x00480E0AU
#define GPIO_55_SD1_C3                  0x00480E0DU
#define GPIO_55_HIC_A0                  0x00480E0FU

#define GPIO_56_GPIO56                  0x00481000U
#define GPIO_56_SPIA_CLK                0x00481001U
#define GPIO_56_CLB_OUTPUTXBAR7         0x00481002U
#define GPIO_56_MCAN_TX                 0x00481003U
#define GPIO_56_EQEP2_STROBE            0x00481005U
#define GPIO_56_SCIB_TX                 0x00481006U
#define GPIO_56_SD2_D1                  0x00481007U
#define GPIO_56_SPIB_SIMO               0x00481009U
#define GPIO_56_I2CA_SDA                0x0048100AU
#define GPIO_56_EQEP1_A                 0x0048100BU
#define GPIO_56_SD1_C4                  0x0048100DU
#define GPIO_56_FSIRXA_D1               0x0048100EU
#define GPIO_56_HIC_D6                  0x0048100FU

#define GPIO_57_GPIO57                  0x00481200U
#define GPIO_57_SPIA_STE                0x00481201U
#define GPIO_57_CLB_OUTPUTXBAR8         0x00481202U
#define GPIO_57_MCAN_RX                 0x00481203U
#define GPIO_57_EQEP2_INDEX             0x00481205U
#define GPIO_57_SCIB_RX                 0x00481206U
#define GPIO_57_SD2_C1                  0x00481207U
#define GPIO_57_SPIB_SOMI               0x00481209U
#define GPIO_57_I2CA_SCL                0x0048120AU
#define GPIO_57_EQEP1_B                 0x0048120BU
#define GPIO_57_FSIRXA_CLK              0x0048120EU
#define GPIO_57_HIC_D4                  0x0048120FU

#define GPIO_58_GPIO58                  0x00481400U
#define GPIO_58_OUTPUTXBAR1             0x00481405U
#define GPIO_58_SPIB_CLK                0x00481406U
#define GPIO_58_SD2_D2                  0x00481407U
#define GPIO_58_LINA_TX                 0x00481409U
#define GPIO_58_CANA_TX                 0x0048140AU
#define GPIO_58_EQEP1_STROBE            0x0048140BU
#define GPIO_58_SD2_C2                  0x0048140DU
#define GPIO_58_FSIRXA_D0               0x0048140EU
#define GPIO_58_HIC_NRDY                0x0048140FU

#define GPIO_59_GPIO59                  0x00481600U
#define GPIO_59_OUTPUTXBAR2             0x00481605U
#define GPIO_59_SPIB_STE                0x00481606U
#define GPIO_59_SD2_C2                  0x00481607U
#define GPIO_59_LINA_RX                 0x00481609U
#define GPIO_59_CANA_RX                 0x0048160AU
#define GPIO_59_EQEP1_INDEX             0x0048160BU
#define GPIO_59_SD2_C3                  0x0048160DU
#define GPIO_59_FSITXA_TDM_D1           0x0048160EU

#define GPIO_60_GPIO60                  0x00481800U
#define GPIO_60_MCAN_TX                 0x00481803U
#define GPIO_60_OUTPUTXBAR3             0x00481805U
#define GPIO_60_SPIB_SIMO               0x00481806U
#define GPIO_60_SD2_D3                  0x00481807U
#define GPIO_60_SD2_C4                  0x0048180DU
#define GPIO_60_HIC_A0                  0x0048180FU

#define GPIO_61_GPIO61                  0x00481A00U
#define GPIO_61_MCAN_RX                 0x00481A03U
#define GPIO_61_OUTPUTXBAR4             0x00481A05U
#define GPIO_61_SPIB_SOMI               0x00481A06U
#define GPIO_61_SD2_C3                  0x00481A07U
#define GPIO_61_CANA_RX                 0x00481A0EU

#define GPIO_224_GPIO224                0x01C60000U
#define GPIO_224_SD2_D3                 0x01C60002U
#define GPIO_224_HIC_A3                 0x01C6000FU

#define GPIO_225_GPIO225                0x01C60200U
#define GPIO_225_SD2_C2                 0x01C60202U
#define GPIO_225_HIC_NWE                0x01C6020FU

#define GPIO_226_GPIO226                0x01C60400U
#define GPIO_226_SD2_D4                 0x01C60402U
#define GPIO_226_HIC_A1                 0x01C6040FU

#define GPIO_227_GPIO227                0x01C60600U
#define GPIO_227_SD1_C3                 0x01C60602U
#define GPIO_227_HIC_NBE0               0x01C6060FU

#define GPIO_228_GPIO228                0x01C60800U
#define GPIO_228_SD2_C1                 0x01C60802U
#define GPIO_228_HIC_A0                 0x01C6080FU

#define GPIO_229_GPIO229                0x01C60A00U

#define GPIO_230_GPIO230                0x01C60C00U
#define GPIO_230_SD1_C4                 0x01C60C02U
#define GPIO_230_HIC_BASESEL2           0x01C60C0FU

#define GPIO_231_GPIO231                0x01C60E00U
#define GPIO_231_SD1_C1                 0x01C60E02U
#define GPIO_231_HIC_BASESEL1           0x01C60E0FU

#define GPIO_232_GPIO232                0x01C61000U
#define GPIO_232_SD1_D4                 0x01C61002U
#define GPIO_232_HIC_BASESEL0           0x01C6100FU

#define GPIO_233_GPIO233                0x01C61200U
#define GPIO_233_SD2_D1                 0x01C61202U
#define GPIO_233_HIC_A4                 0x01C6120FU

#define GPIO_236_GPIO236                0x01C61800U

#define GPIO_237_GPIO237                0x01C61A00U
#define GPIO_237_SD1_D2                 0x01C61A02U
#define GPIO_237_HIC_A6                 0x01C61A0FU

#define GPIO_238_GPIO238                0x01C61C00U
#define GPIO_238_SD2_C3                 0x01C61C02U
#define GPIO_238_HIC_NCS                0x01C61C0FU

#define GPIO_239_GPIO239                0x01C61E00U
#define GPIO_239_SD1_D1                 0x01C61E02U
#define GPIO_239_HIC_A5                 0x01C61E0FU

#define GPIO_240_GPIO240                0x01C80000U
#define GPIO_240_SD2_C1                 0x01C80002U
#define GPIO_240_HIC_NBE1               0x01C8000FU

#define GPIO_241_GPIO241                0x01C80200U
#define GPIO_241_SD2_C1                 0x01C80202U
#define GPIO_241_HIC_NBE1               0x01C8020FU

#define GPIO_242_GPIO242                0x01C80400U
#define GPIO_242_SD2_D2                 0x01C80402U
#define GPIO_242_HIC_A2                 0x01C8040FU

#define GPIO_244_GPIO244                0x01C80800U
#define GPIO_244_SD1_D3                 0x01C80802U
#define GPIO_244_HIC_A7                 0x01C8080FU

#define GPIO_245_GPIO245                0x01C80A00U
#define GPIO_245_SD1_C2                 0x01C80A02U
#define GPIO_245_HIC_NOE                0x01C80A0FU

#define GPIO_247_GPIO247                0x01C80E00U

#define GPIO_248_GPIO248                0x01C81000U

#define GPIO_249_GPIO249                0x01C81200U

#define GPIO_251_GPIO251                0x01C81600U

#define GPIO_252_GPIO252                0x01C81800U
#define GPIO_252_SD2_C4                 0x01C81802U

#define GPIO_253_GPIO253                0x01C81A00U

#endif // PIN_MAP_H
